{"config": [{"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "padding": "valid", "filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "padding": "valid", "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 640, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 46, "use_bias": true, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}